DataProcessors/общ_РедактированиеКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>общ_РедактированиеКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьВРегистр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаКонтактнойИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/общ_РедактированиеКонтактнойИнформации/Forms/УправляемаяФормаЗаписиТелефона/Ext/Form/Module.bsl
&НаКлиенте
Перем мОбработкаТайпинга;
&НаКлиенте
Перем мТекстТайпинга;
&НаКлиенте
Перем мПоследнееЗначениеЭлементаТайпинга;
&НаКлиенте
Перем мСтруктураИзмерений Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

// Процедура вызывается при открытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.Объект.ТолькоПросмотр     = НЕ Объект.ДоступностьОбъекта;
	
	Если Объект.Вид = Неопределено Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Объект) И Объект.ДоступностьОбъекта Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Объект;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Вид;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Поле3;
	КонецЕсли; 
	
	мПоследнееЗначениеЭлементаТайпинга = Объект.Вид;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Сохранение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранение(Закрывать) 
	Если Объект.Представление <> "" И ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
		ОповеститьОВыборе(куфиб_УправлениеКонтактнойИнформациейКлиент.СохранениеКИ(Объект, Параметры));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Кнопка)
	Сохранение(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере(Отказ)
	
	Если Модифицированность Тогда
		Об = ДанныеФормыВЗначение("Объект",Объект);
		Отказ = об.ЗакрыватьФормуРедактирования();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

// Процедура вызывается при очистке значения элемента формы Объект.
//
&НаКлиенте
Процедура ОбъектОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Вид) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли; 
КонецПроцедуры

// Процедура вызывается при изменении реквизита Поле3 - собственно номер телефона.
&НаКлиенте
Процедура Поле3ПриИзменении(Элемент)
 	Элемент = куфиб_УправлениеКонтактнойИнформацией.ПривестиНомерТелефонаКШаблону(Элемент.ТекстРедактирования);
	КопияОбъект = Объект;
	Объект.Представление=куфиб_УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(КопияОбъект);
КонецПроцедуры // Поле3ПриИзменении()

// Процедура вызывается при изменении реквизита Поле4 - добавочный номер телефона.
&НаКлиенте
Процедура Поле4ПриИзменении(Элемент)
	
	Элемент = куфиб_УправлениеКонтактнойИнформацией.ПривестиНомерТелефонаКШаблону(Элемент.ТекстРедактирования);
	КопияОбъект=Объект;
	Объект.Представление=куфиб_УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(КопияОбъект);
	
КонецПроцедуры // Поле4ПриИзменении()

// Процедура вызывается при изменении реквизита Поле1 - код страны.
&НаКлиенте
Процедура Поле1ПриИзменении(Элемент)
	
	Если Лев(СокрЛ(Объект.Поле1), 1) <> "+" И НЕ ПустаяСтрока(Объект.Поле1) Тогда
		Объект.Поле1 = СокрЛП(Объект.Поле1);
		Пока Лев(Объект.Поле1, 1) = "0" Цикл
			Объект.Поле1 = Сред(Объект.Поле1, 2);
		КонецЦикла;
		Если НЕ ПустаяСтрока(Объект.Поле1) Тогда
			Объект.Поле1 = "+" + Объект.Поле1;
		КонецЕсли; 
	КонецЕсли; 
	КопияОбъект=Объект;
	Объект.Представление=куфиб_УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(КопияОбъект);
	
КонецПроцедуры // Поле1ПриИзменении()

// Процедура вызывается при изменении реквизита Поле2 - код города.
&НаКлиенте
Процедура Поле2ПриИзменении(Элемент)
	КопияОбъект=Объект;
	Объект.Представление=куфиб_УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(КопияОбъект);
	
КонецПроцедуры // Поле2ПриИзменении()

// Процедура перехватывает момент начала выбора вида контактной информации.
//
// Параметры
//  Элемент - элемент формы, выбор значения которого должен произойти
//  СтандартнаяОбработка - булево, флаг стандартной обработки выбора.
&НаКлиенте
Процедура ВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Объект = Неопределено ИЛИ Объект.Объект.Пустая() Тогда
		Сообщить("Выберите объект.");
		Возврат;
	КонецЕсли;
    Тип = Объект.Тип;
	КопияОбъект = Объект.Объект;
	ВидОбъектаКИ = куфиб_УправлениеКонтактнойИнформацией.ВидОбъектаКИ(КопияОбъект);
	куфиб_УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВыбораВидаКИ(Истина, Элемент, Тип,ВидОбъектаКИ);
	
КонецПроцедуры // ВидНачалоВыбора()

// Процедура перехватывает момент начала выбора Объекта.
//
// Параметры
//  Элемент - элемент формы, выбор значения которого должен произойти
//  СтандартнаяОбработка - булево, флаг стандартной обработки выбора.
&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = куфиб_УправлениеКонтактнойИнформациейКлиент.НачалоВыбораОбъектаКИ(ЭтаФорма, Элемент, глТекущийПользователь);

КонецПроцедуры

// Процедура обработчик события ОкончаниеВводаТекста элемента формы Вид.
//
&НаКлиенте
Процедура ВидОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	куфиб_РаботаСДиалогами.ОкончаниеВводаТекстаВЭлементеУправления(Элемент, Текст, Значение, СтандартнаяОбработка, Новый Структура("Тип, ВидОбъектаКонтактнойИнформации", Объект.Тип, УправлениеКонтактнойИнформацией.ВидОбъектаКИ(Объект)), ЭтаФорма, Тип("СправочникСсылка.ВидыКонтактнойИнформации"), мОбработкаТайпинга, мТекстТайпинга, мПоследнееЗначениеЭлементаТайпинга);
	
КонецПроцедуры

// Процедура обработчик события ПриИзменении элемента формы Вид.
//
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	мПоследнееЗначениеЭлементаТайпинга = Элемент;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	куфиб_УправлениеКонтактнойИнформацией.УстановкаПараметровОкна(Параметры, Объект, Элементы);		
	//оформление
	оф_ТелефонЗаголовок = "Телефон";
КонецПроцедуры


мОбработкаТайпинга                 = Ложь;
мТекстТайпинга                     = "";
мПоследнееЗначениеЭлементаТайпинга = Неопределено;
мСтруктураИзмерений                = Неопределено;
